{"class_name": "Functional", "config": {"name": "functional_53", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "int32", "sparse": false, "ragged": false, "name": "Histologia"}, "name": "Histologia", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_72", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_72", "inbound_nodes": [[["Histologia", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 516, 516, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "Imagen"}, "name": "Imagen", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "dropout_43", "inbound_nodes": [[["dense_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_87", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_87", "inbound_nodes": [[["Imagen", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_73", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_73", "inbound_nodes": [[["dropout_43", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_63", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_63", "inbound_nodes": [[["conv2d_87", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_64", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_64", "inbound_nodes": [[["dense_73", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_26", "inbound_nodes": [[["flatten_63", 0, 0, {}], ["flatten_64", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_44", "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Salida", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Salida", "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}], "input_layers": [["Imagen", 0, 0], ["Histologia", 0, 0]], "output_layers": [["Salida", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}